Revit 2024 API
BuiltInFailures.RoofFailures.JoinedRoofMissesTarget Property
 Part of the roof to be joined misses the target face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId JoinedRoofMissesTarget { get; }
Visual Basic
Public Shared ReadOnly Property JoinedRoofMissesTarget As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ JoinedRoofMissesTarget {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace